app/controllers/notes_controller.rb

  def create
    @note = Note.create! params.require(:note).permit(:content)
---
INSERT INTO "notes" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "this will save to db"], ["created_at", "2014-12-06 21:55:53.232536"], ["updated_at", "2014-12-06 21:55:53.232536"]]

  def destroy
    Note.find(params[:id]).destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = $1 LIMIT 1  [["id", 3]]

  def index
    @notes = Note.order created_at: :desc
---
SELECT "notes".* FROM "notes"   ORDER BY "notes"."created_at" DESC

  def show
    @note = Note.find params[:id]
---
SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = $1 LIMIT 1  [["id", 1]]